/*
  Виведіть у консоль загальну кількість яблук та винограду та їх різницю
*/

const apples = 47;

const grapes = 135;

/*
  Заміни вираз вираз перевизначення комбінованим оператором +=
*/

let students = 100;

students = students + 50;

console.log(students);

/*
  Розбери пріоритет операторів в інструкції присвоєння
*/

const result = 108 + 223 - 2 * 5;

/*
  Напиши скрип, який виводить у консоль заокруглені значення value

  Використовуй методи Math.round(), Math.floor(), Math.ceil()

  Перевірте, що буде в консолі при значеннях 27.3 та 27.9
*/

const value = 27.5;

/*
  Склади за допомогою шаблонних рядків речення: A has B bots in stock,
  де A та В - змінні вставлені в рядок
*/

const companyName = "Cyberdyne Systems";

const repairBots = 150;

const defenceBots = 50;

/*
  Методи рядків та чейнінг

  Напиши скрипт, який розраховує індекс маси тіла людини

  Для цього потрібно розділити вагу в кілограмах на квадрат висоти у метрах

  Вага та висота зберігаються в змінних weight і height, але не як числа, а у вигляді рядків (спеціально для завдання)

  Нецілі числа можуть бути задані у вигляді 24.7 або 24,7 тобто як роздільник дробної частини числа може бути кома

  Індекс маси тіла необхідно округлити до однієї цифри після коми
  */

let weight = "88,3";
let height = "1.98";

// const bmi =

// console.log(bmi)
