// https://www.codewars.com/join?language=javascript
// ---------------Kahoot---------//

// Мутабельні та імутабельні типи даних
// https://developer.mozilla.org/en-US/docs/Glossary/Mutable
// const clients = ["Mango", "Poly", "Ajax"];
// const string = "script";

// // Імутабельні
// string[0] = "q";
// console.log(string);

// // Мутабельні

// clients.splice(1, 1);
// console.log(clients);

// За посиланням
// Складні (якщо говорити правильно то тільки Object)
//  Object
//  Array
// const arr1 = [1, 2, 3];
// const arr2 = arr;

// За значенням
// Примітивні
// String
// Number
// Boolean
// null
// undefined

// let a = 10;
// let b = a;

/*
  Example 1 - Базові операції з масивом

  [] літерал масиву

  Властивість length та індексація
  
  Створіть масив genres з елементами Jazz і Blues

  Додайте 'Rock&roll' у кінець масиву

  Виведіть у консоль перший елемент масиву

  Виведіть у консоль останній елемент масиву. 
  Код має працювати для масиву довільної довжини.

  Вставте 'Contry' та 'Reggie' на початок масиву

  Подивиттсь методи push unshift shift splice
*/

/*  
  Example 2 - Масиви та рядки

  Напиши скрипт для обчислення площі прямокутника зі сторонами, 
  значення яких зберігаються в змінній величин у вигляді рядка.
  Значення гарантовано розділені пробілом. 

  Метод split
*/

// const values = '8 11';

/*
  Example 3 - Перебір масиву

  Напиши скрипт для перебору масиву fruits циклом for.
  Для кожного елемента масиву виведіть у консоль рядок у 
  форматі номер_елемента: значення_елемента. 
  
  Нумерація елементів має починатися з першого.
*/

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];

/*
  Example 4 - Масиви та цикли

  Напиши скрипт, який виводить у консоль ім'я та телефонний 
  номер користувача. У змінних names і phones зберігаються 
  рядки імен та телефонних номерів, розділені комами. 
  
  Порядковий номер імен та телефонів у рядках вказують на 
  відповідність. Кількість імен та телефонів гарантовано однакова.

  Метод split
*/

// const names = 'Jacob,William,Solomon,Kate';
// const phones = '38001234567,38001112233,380055566377,38099912233';

/*
  Example 5 - Масиви та рядки

  Напиши скрипт який виводить у консоль усі слова рядка крім першого 
  та останнього. Результуючий рядок не повинен починатися або закінчуватися 
  пробілом. Скрипт повинен працювати для будь-якого рядка.

  методи pop shift join
*/

// const string = 'Welcome to the future';

/*
  Example 6 - Масиви та рядки
  Напиши скрипт, який «розвертає» рядок (зворотній порядок літер)
  і виводить його в консоль.

  Методи split reverse join
*/

// const string = 'Welcome to the future';

/*
  Example 7 - Пошук елемента

  Напиши скрипт пошуку найменшого числа у масиві. 
  Код має працювати для будь-якого масиву чисел. 
  Використовуй цикл for of для розв'язання задачі.
*/

// const numbers = [101, 78, 12, 76, 5, 11, 9];
