// 1. Що буде виведено у консоль ?

console.log(10 >= "7");

console.log("2" > "12");

console.log("2" < "12");

// console.log("4" == 4);

// console.log("6" === 6);

// console.log("false" === false);

// console.log(1 == true);

// console.log(1 === true);

// console.log("0" == false);

// console.log("0" === false);

// console.log("Papaya" < "papaya");

// console.log("Papaya" === "papaya");

// console.log(undefined == null);

// console.log(undefined === null);

/*
  2. Використовуючи конструкцію if...else та prompt, напиши код, який 
  запитуватиме: 'Який стандарт мови JavaScript?'. Якщо користувач вводить
  ECMAScript, то показуй alert з рядком 'Вірно!', інакше - 'Не знаєте? ECMAScript!'
*/

/*
  3. Напиши скрипт, який приводить у консоль рядок 'Це додатнє число', якщо
  в prompt користував ввів число більше за нуль. Якщо було введено нуль,
  виводь у консоль рядок 'Це нуль'. Якщо передали від'ємне число, у консолі
  має бути рядок 'Це від`ємне число'
*/

/*
  4. Напиши скрипт, який перевіряє чи закінчується значення змінної link
  символом '/'. Якщо ні, додай у кінець посилання цей символ  
*/

const link = "https://instagram.com/andrii_shevchukk";

/*
  5. Напиши скрипт для відображення дедлайну - часу здачі проєкту. Використовуй
  конструкцію switch...case

  Якщо до дедлайну 0 днів - виведи рядок 'Cьогодні'
  Якщо до дедлайну 1 день - виведи рядок 'Завтра'
  Якщо до дедлайну 2 дні - виведи рядок 'Післязавтра'
  Якщо до дедлайну 3+ днів - виведи рядок 'Можна відпочити :)'
*/

/*
  6. Напиши скрипт котрий порахує суму чисел від 1 до 10 та виведе у консоль результат 
*/

/*
  7. Напиши цикл for який виводить у консоль браузера числа за зростанням від
  min дo max, але якщо число кратне 5
*/

const min = 20;

const max = 100;

/*
  8. Напишіть скрипт який порахує скільки на проміжку від from до to було чисел,
  які є кратними 7
*/

/* 
  9. Напишіть скрипт для світлофора, де користувач може ввести назву кольору
  у prompt і в залежності від того який був введений колір відображатимуться
  різні повідомлення через alert. Використовуй конструкцію switch case
  
  red - 'STOP!!!!'

  green - 'GO!'

  yellow - 'Wait a little!'
*/

/*
  10. Напиши скрипт який буде просити нас ввести число більше за 100, доки
  ми таке не введемо
    
  Скористайся циклом while
*/
